zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/atsame54/atsame54p19a-pinctrl.h
/* pa16c_sercom1_pad0 */
#define PA16C_SERCOM1_PAD0 MCHP_PINMUX(a, 16, c, periph)

/* pa16d_sercom3_pad1 */
#define PA16D_SERCOM3_PAD1 MCHP_PINMUX(a, 16, d, periph)

/* pa16e_tc2_wo0 */
#define PA16E_TC2_WO0 MCHP_PINMUX(a, 16, e, periph)

/* pa16f_tcc1_wo0 */
#define PA16F_TCC1_WO0 MCHP_PINMUX(a, 16, f, periph)

/* pa16g_tcc0_wo4 */
#define PA16G_TCC0_WO4 MCHP_PINMUX(a, 16, g, periph)

/* pa16k_pcc_data0 */
#define PA16K_PCC_DATA0 MCHP_PINMUX(a, 16, k, periph)

/* pa16l_gmac_gcrs */
#define PA16L_GMAC_GCRS MCHP_PINMUX(a, 16, l, periph)

/* pa16m_gclk_io2 */
#define PA16M_GCLK_IO2 MCHP_PINMUX(a, 16, m, periph)

/* pa16n_ccl_in0 */
#define PA16N_CCL_IN0 MCHP_PINMUX(a, 16, n, periph)

/* pa17_gpio */
#define PA17_GPIO MCHP_PINMUX(a, 17, gpio, gpio)

/* pa17a_eic_extint1 */
#define PA17A_EIC_EXTINT1 MCHP_PINMUX(a, 17, a, periph)

/* pa17b_adc0_x11 */
#define PA17B_ADC0_X11 MCHP_PINMUX(a, 17, b, periph)

/* pa17b_adc0_y11 */
#define PA17B_ADC0_Y11 MCHP_PINMUX(a, 17, b, periph)

/* pa17c_sercom1_pad1 */
#define PA17C_SERCOM1_PAD1 MCHP_PINMUX(a, 17, c, periph)

/* pa17d_sercom3_pad0 */
#define PA17D_SERCOM3_PAD0 MCHP_PINMUX(a, 17, d, periph)

/* pa17e_tc2_wo1 */
#define PA17E_TC2_WO1 MCHP_PINMUX(a, 17, e, periph)

/* pa17f_tcc1_wo1 */
#define PA17F_TCC1_WO1 MCHP_PINMUX(a, 17, f, periph)

/* pa17g_tcc0_wo5 */
#define PA17G_TCC0_WO5 MCHP_PINMUX(a, 17, g, periph)

/* pa17k_pcc_data1 */
#define PA17K_PCC_DATA1 MCHP_PINMUX(a, 17, k, periph)

/* pa17l_gmac_gtxen */
#define PA17L_GMAC_GTXEN MCHP_PINMUX(a, 17, l, periph)

/* pa17m_gclk_io3 */
#define PA17M_GCLK_IO3 MCHP_PINMUX(a, 17, m, periph)

/* pa17n_ccl_in1 */
#define PA17N_CCL_IN1 MCHP_PINMUX(a, 17, n, periph)

/* pa18_gpio */
#define PA18_GPIO MCHP_PINMUX(a, 18, gpio, gpio)

/* pa18a_eic_extint2 */
#define PA18A_EIC_EXTINT2 MCHP_PINMUX(a, 18, a, periph)

/* pa18b_adc0_x12 */
#define PA18B_ADC0_X12 MCHP_PINMUX(a, 18, b, periph)

/* pa18b_adc0_y12 */
#define PA18B_ADC0_Y12 MCHP_PINMUX(a, 18, b, periph)

/* pa18c_sercom1_pad2 */
#define PA18C_SERCOM1_PAD2 MCHP_PINMUX(a, 18, c, periph)

/* pa18d_sercom3_pad2 */
#define PA18D_SERCOM3_PAD2 MCHP_PINMUX(a, 18, d, periph)

/* pa18e_tc3_wo0 */
#define PA18E_TC3_WO0 MCHP_PINMUX(a, 18, e, periph)

/* pa18f_tcc1_wo2 */
#define PA18F_TCC1_WO2 MCHP_PINMUX(a, 18, f, periph)

/* pa18g_tcc0_wo6 */
#define PA18G_TCC0_WO6 MCHP_PINMUX(a, 18, g, periph)

/* pa18k_pcc_data2 */
#define PA18K_PCC_DATA2 MCHP_PINMUX(a, 18, k, periph)

/* pa18l_gmac_gtx0 */
#define PA18L_GMAC_GTX0 MCHP_PINMUX(a, 18, l, periph)

/* pa18m_ac_cmp0 */
#define PA18M_AC_CMP0 MCHP_PINMUX(a, 18, m, periph)

/* pa18n_ccl_in2 */
#define PA18N_CCL_IN2 MCHP_PINMUX(a, 18, n, periph)

/* pa19_gpio */
#define PA19_GPIO MCHP_PINMUX(a, 19, gpio, gpio)

/* pa19a_eic_extint3 */
#define PA19A_EIC_EXTINT3 MCHP_PINMUX(a, 19, a, periph)

/* pa19b_adc0_x13 */
#define PA19B_ADC0_X13 MCHP_PINMUX(a, 19, b, periph)

/* pa19b_adc0_y13 */
#define PA19B_ADC0_Y13 MCHP_PINMUX(a, 19, b, periph)

/* pa19c_sercom1_pad3 */
#define PA19C_SERCOM1_PAD3 MCHP_PINMUX(a, 19, c, periph)

/* pa19d_sercom3_pad3 */
#define PA19D_SERCOM3_PAD3 MCHP_PINMUX(a, 19, d, periph)

/* pa19e_tc3_wo1 */
#define PA19E_TC3_WO1 MCHP_PINMUX(a, 19, e, periph)

/* pa19f_tcc1_wo3 */
#define PA19F_TCC1_WO3 MCHP_PINMUX(a, 19, f, periph)

/* pa19g_tcc0_wo7 */
#define PA19G_TCC0_WO7 MCHP_PINMUX(a, 19, g, periph)

/* pa19k_pcc_data3 */
#define PA19K_PCC_DATA3 MCHP_PINMUX(a, 19, k, periph)

/* pa19l_gmac_gtx1 */
#define PA19L_GMAC_GTX1 MCHP_PINMUX(a, 19, l, periph)

/* pa19m_ac_cmp1 */
#define PA19M_AC_CMP1 MCHP_PINMUX(a, 19, m, periph)

/* pa19n_ccl_out0 */
#define PA19N_CCL_OUT0 MCHP_PINMUX(a, 19, n, periph)

/* pa20_gpio */
#define PA20_GPIO MCHP_PINMUX(a, 20, gpio, gpio)

/* pa20a_eic_extint4 */
#define PA20A_EIC_EXTINT4 MCHP_PINMUX(a, 20, a, periph)

/* pa20b_adc0_x14 */
#define PA20B_ADC0_X14 MCHP_PINMUX(a, 20, b, periph)

/* pa20b_adc0_y14 */
#define PA20B_ADC0_Y14 MCHP_PINMUX(a, 20, b, periph)

/* pa20c_sercom5_pad2 */
#define PA20C_SERCOM5_PAD2 MCHP_PINMUX(a, 20, c, periph)

/* pa20d_sercom3_pad2 */
#define PA20D_SERCOM3_PAD2 MCHP_PINMUX(a, 20, d, periph)

/* pa20e_tc7_wo0 */
#define PA20E_TC7_WO0 MCHP_PINMUX(a, 20, e, periph)

/* pa20f_tcc1_wo4 */
#define PA20F_TCC1_WO4 MCHP_PINMUX(a, 20, f, periph)

/* pa20g_tcc0_wo0 */
#define PA20G_TCC0_WO0 MCHP_PINMUX(a, 20, g, periph)

/* pa20i_sdhc1_sdcmd */
#define PA20I_SDHC1_SDCMD MCHP_PINMUX(a, 20, i, periph)

/* pa20j_i2s_fs0 */
#define PA20J_I2S_FS0 MCHP_PINMUX(a, 20, j, periph)

/* pa20k_pcc_data4 */
#define PA20K_PCC_DATA4 MCHP_PINMUX(a, 20, k, periph)

/* pa20l_gmac_gmdc */
#define PA20L_GMAC_GMDC MCHP_PINMUX(a, 20, l, periph)

/* pa21_gpio */
#define PA21_GPIO MCHP_PINMUX(a, 21, gpio, gpio)

/* pa21a_eic_extint5 */
#define PA21A_EIC_EXTINT5 MCHP_PINMUX(a, 21, a, periph)

/* pa21b_adc0_x15 */
#define PA21B_ADC0_X15 MCHP_PINMUX(a, 21, b, periph)

/* pa21b_adc0_y15 */
#define PA21B_ADC0_Y15 MCHP_PINMUX(a, 21, b, periph)

/* pa21c_sercom5_pad3 */
#define PA21C_SERCOM5_PAD3 MCHP_PINMUX(a, 21, c, periph)

/* pa21d_sercom3_pad3 */
#define PA21D_SERCOM3_PAD3 MCHP_PINMUX(a, 21, d, periph)

/* pa21e_tc7_wo1 */
#define PA21E_TC7_WO1 MCHP_PINMUX(a, 21, e, periph)

/* pa21f_tcc1_wo5 */
#define PA21F_TCC1_WO5 MCHP_PINMUX(a, 21, f, periph)

/* pa21g_tcc0_wo1 */
#define PA21G_TCC0_WO1 MCHP_PINMUX(a, 21, g, periph)

/* pa21i_sdhc1_sdck */
#define PA21I_SDHC1_SDCK MCHP_PINMUX(a, 21, i, periph)

/* pa21j_i2s_sdo */
#define PA21J_I2S_SDO MCHP_PINMUX(a, 21, j, periph)

/* pa21k_pcc_data5 */
#define PA21K_PCC_DATA5 MCHP_PINMUX(a, 21, k, periph)

/* pa21l_gmac_gmdio */
#define PA21L_GMAC_GMDIO MCHP_PINMUX(a, 21, l, periph)

/* pa22_gpio */
#define PA22_GPIO MCHP_PINMUX(a, 22, gpio, gpio)

/* pa22a_eic_extint6 */
#define PA22A_EIC_EXTINT6 MCHP_PINMUX(a, 22, a, periph)

/* pa22b_adc0_x16 */
#define PA22B_ADC0_X16 MCHP_PINMUX(a, 22, b, periph)

/* pa22b_adc0_y16 */
#define PA22B_ADC0_Y16 MCHP_PINMUX(a, 22, b, periph)

/* pa22c_sercom3_pad0 */
#define PA22C_SERCOM3_PAD0 MCHP_PINMUX(a, 22, c, periph)

/* pa22d_sercom5_pad1 */
#define PA22D_SERCOM5_PAD1 MCHP_PINMUX(a, 22, d, periph)

/* pa22e_tc4_wo0 */
#define PA22E_TC4_WO0 MCHP_PINMUX(a, 22, e, periph)

/* pa22f_tcc1_wo6 */
#define PA22F_TCC1_WO6 MCHP_PINMUX(a, 22, f, periph)

/* pa22g_tcc0_wo2 */
#define PA22G_TCC0_WO2 MCHP_PINMUX(a, 22, g, periph)

