zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/atsame54/atsame54p19a-pinctrl.h
/* pb2n_ccl_out0 */
#define PB2N_CCL_OUT0 MCHP_PINMUX(b, 2, n, periph)

/* pb3_gpio */
#define PB3_GPIO MCHP_PINMUX(b, 3, gpio, gpio)

/* pb3a_eic_extint3 */
#define PB3A_EIC_EXTINT3 MCHP_PINMUX(b, 3, a, periph)

/* pb3b_adc0_ain15 */
#define PB3B_ADC0_AIN15 MCHP_PINMUX(b, 3, b, periph)

/* pb3b_adc0_x21 */
#define PB3B_ADC0_X21 MCHP_PINMUX(b, 3, b, periph)

/* pb3b_adc0_y21 */
#define PB3B_ADC0_Y21 MCHP_PINMUX(b, 3, b, periph)

/* pb3d_sercom5_pad1 */
#define PB3D_SERCOM5_PAD1 MCHP_PINMUX(b, 3, d, periph)

/* pb3e_tc6_wo1 */
#define PB3E_TC6_WO1 MCHP_PINMUX(b, 3, e, periph)

/* pb4_gpio */
#define PB4_GPIO MCHP_PINMUX(b, 4, gpio, gpio)

/* pb4a_eic_extint4 */
#define PB4A_EIC_EXTINT4 MCHP_PINMUX(b, 4, a, periph)

/* pb4b_adc0_x22 */
#define PB4B_ADC0_X22 MCHP_PINMUX(b, 4, b, periph)

/* pb4b_adc0_y22 */
#define PB4B_ADC0_Y22 MCHP_PINMUX(b, 4, b, periph)

/* pb4b_adc1_ain6 */
#define PB4B_ADC1_AIN6 MCHP_PINMUX(b, 4, b, periph)

/* pb5_gpio */
#define PB5_GPIO MCHP_PINMUX(b, 5, gpio, gpio)

/* pb5a_eic_extint5 */
#define PB5A_EIC_EXTINT5 MCHP_PINMUX(b, 5, a, periph)

/* pb5b_adc0_x23 */
#define PB5B_ADC0_X23 MCHP_PINMUX(b, 5, b, periph)

/* pb5b_adc0_y23 */
#define PB5B_ADC0_Y23 MCHP_PINMUX(b, 5, b, periph)

/* pb5b_adc1_ain7 */
#define PB5B_ADC1_AIN7 MCHP_PINMUX(b, 5, b, periph)

/* pb6_gpio */
#define PB6_GPIO MCHP_PINMUX(b, 6, gpio, gpio)

/* pb6a_eic_extint6 */
#define PB6A_EIC_EXTINT6 MCHP_PINMUX(b, 6, a, periph)

/* pb6b_adc0_x24 */
#define PB6B_ADC0_X24 MCHP_PINMUX(b, 6, b, periph)

/* pb6b_adc0_y24 */
#define PB6B_ADC0_Y24 MCHP_PINMUX(b, 6, b, periph)

/* pb6b_adc1_ain8 */
#define PB6B_ADC1_AIN8 MCHP_PINMUX(b, 6, b, periph)

/* pb6n_ccl_in6 */
#define PB6N_CCL_IN6 MCHP_PINMUX(b, 6, n, periph)

/* pb7_gpio */
#define PB7_GPIO MCHP_PINMUX(b, 7, gpio, gpio)

/* pb7a_eic_extint7 */
#define PB7A_EIC_EXTINT7 MCHP_PINMUX(b, 7, a, periph)

/* pb7b_adc0_x25 */
#define PB7B_ADC0_X25 MCHP_PINMUX(b, 7, b, periph)

/* pb7b_adc0_y25 */
#define PB7B_ADC0_Y25 MCHP_PINMUX(b, 7, b, periph)

/* pb7b_adc1_ain9 */
#define PB7B_ADC1_AIN9 MCHP_PINMUX(b, 7, b, periph)

/* pb7n_ccl_in7 */
#define PB7N_CCL_IN7 MCHP_PINMUX(b, 7, n, periph)

/* pb8_gpio */
#define PB8_GPIO MCHP_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 MCHP_PINMUX(b, 8, a, periph)

/* pb8b_adc0_ain2 */
#define PB8B_ADC0_AIN2 MCHP_PINMUX(b, 8, b, periph)

/* pb8b_adc0_x1 */
#define PB8B_ADC0_X1 MCHP_PINMUX(b, 8, b, periph)

/* pb8b_adc0_y1 */
#define PB8B_ADC0_Y1 MCHP_PINMUX(b, 8, b, periph)

/* pb8b_adc1_ain0 */
#define PB8B_ADC1_AIN0 MCHP_PINMUX(b, 8, b, periph)

/* pb8d_sercom4_pad0 */
#define PB8D_SERCOM4_PAD0 MCHP_PINMUX(b, 8, d, periph)

/* pb8e_tc4_wo0 */
#define PB8E_TC4_WO0 MCHP_PINMUX(b, 8, e, periph)

/* pb8n_ccl_in8 */
#define PB8N_CCL_IN8 MCHP_PINMUX(b, 8, n, periph)

/* pb9_gpio */
#define PB9_GPIO MCHP_PINMUX(b, 9, gpio, gpio)

/* pb9a_eic_extint9 */
#define PB9A_EIC_EXTINT9 MCHP_PINMUX(b, 9, a, periph)

/* pb9b_adc0_ain3 */
#define PB9B_ADC0_AIN3 MCHP_PINMUX(b, 9, b, periph)

/* pb9b_adc0_x2 */
#define PB9B_ADC0_X2 MCHP_PINMUX(b, 9, b, periph)

/* pb9b_adc0_y2 */
#define PB9B_ADC0_Y2 MCHP_PINMUX(b, 9, b, periph)

/* pb9b_adc1_ain1 */
#define PB9B_ADC1_AIN1 MCHP_PINMUX(b, 9, b, periph)

/* pb9d_sercom4_pad1 */
#define PB9D_SERCOM4_PAD1 MCHP_PINMUX(b, 9, d, periph)

/* pb9e_tc4_wo1 */
#define PB9E_TC4_WO1 MCHP_PINMUX(b, 9, e, periph)

/* pb9n_ccl_out2 */
#define PB9N_CCL_OUT2 MCHP_PINMUX(b, 9, n, periph)

/* pb10_gpio */
#define PB10_GPIO MCHP_PINMUX(b, 10, gpio, gpio)

/* pb10a_eic_extint10 */
#define PB10A_EIC_EXTINT10 MCHP_PINMUX(b, 10, a, periph)

/* pb10d_sercom4_pad2 */
#define PB10D_SERCOM4_PAD2 MCHP_PINMUX(b, 10, d, periph)

/* pb10e_tc5_wo0 */
#define PB10E_TC5_WO0 MCHP_PINMUX(b, 10, e, periph)

/* pb10f_tcc0_wo4 */
#define PB10F_TCC0_WO4 MCHP_PINMUX(b, 10, f, periph)

/* pb10g_tcc1_wo0 */
#define PB10G_TCC1_WO0 MCHP_PINMUX(b, 10, g, periph)

/* pb10h_qspi_sck */
#define PB10H_QSPI_SCK MCHP_PINMUX(b, 10, h, periph)

/* pb10i_sdhc0_sddat3 */
#define PB10I_SDHC0_SDDAT3 MCHP_PINMUX(b, 10, i, periph)

/* pb10j_i2s_sdi */
#define PB10J_I2S_SDI MCHP_PINMUX(b, 10, j, periph)

/* pb10m_gclk_io4 */
#define PB10M_GCLK_IO4 MCHP_PINMUX(b, 10, m, periph)

/* pb10n_ccl_in11 */
#define PB10N_CCL_IN11 MCHP_PINMUX(b, 10, n, periph)

/* pb11_gpio */
#define PB11_GPIO MCHP_PINMUX(b, 11, gpio, gpio)

/* pb11a_eic_extint11 */
#define PB11A_EIC_EXTINT11 MCHP_PINMUX(b, 11, a, periph)

/* pb11d_sercom4_pad3 */
#define PB11D_SERCOM4_PAD3 MCHP_PINMUX(b, 11, d, periph)

/* pb11e_tc5_wo1 */
#define PB11E_TC5_WO1 MCHP_PINMUX(b, 11, e, periph)

/* pb11f_tcc0_wo5 */
#define PB11F_TCC0_WO5 MCHP_PINMUX(b, 11, f, periph)

/* pb11g_tcc1_wo1 */
#define PB11G_TCC1_WO1 MCHP_PINMUX(b, 11, g, periph)

/* pb11h_qspi_cs */
#define PB11H_QSPI_CS MCHP_PINMUX(b, 11, h, periph)

/* pb11i_sdhc0_sdck */
#define PB11I_SDHC0_SDCK MCHP_PINMUX(b, 11, i, periph)

/* pb11j_i2s_fs1 */
#define PB11J_I2S_FS1 MCHP_PINMUX(b, 11, j, periph)

/* pb11m_gclk_io5 */
#define PB11M_GCLK_IO5 MCHP_PINMUX(b, 11, m, periph)

/* pb11n_ccl_out1 */
#define PB11N_CCL_OUT1 MCHP_PINMUX(b, 11, n, periph)

/* pb12_gpio */
#define PB12_GPIO MCHP_PINMUX(b, 12, gpio, gpio)

/* pb12a_eic_extint12 */
#define PB12A_EIC_EXTINT12 MCHP_PINMUX(b, 12, a, periph)

/* pb12b_adc0_x26 */
#define PB12B_ADC0_X26 MCHP_PINMUX(b, 12, b, periph)

/* pb12b_adc0_y26 */
#define PB12B_ADC0_Y26 MCHP_PINMUX(b, 12, b, periph)

/* pb12c_sercom4_pad0 */
#define PB12C_SERCOM4_PAD0 MCHP_PINMUX(b, 12, c, periph)

/* pb12e_tc4_wo0 */
#define PB12E_TC4_WO0 MCHP_PINMUX(b, 12, e, periph)

/* pb12f_tcc3_wo0 */
#define PB12F_TCC3_WO0 MCHP_PINMUX(b, 12, f, periph)

/* pb12g_tcc0_wo0 */
#define PB12G_TCC0_WO0 MCHP_PINMUX(b, 12, g, periph)

/* pb12h_can1_tx */
#define PB12H_CAN1_TX MCHP_PINMUX(b, 12, h, periph)

/* pb12i_sdhc0_sdcd */
#define PB12I_SDHC0_SDCD MCHP_PINMUX(b, 12, i, periph)

/* pb12j_i2s_sck1 */
#define PB12J_I2S_SCK1 MCHP_PINMUX(b, 12, j, periph)

/* pb12m_gclk_io6 */
#define PB12M_GCLK_IO6 MCHP_PINMUX(b, 12, m, periph)

/* pb13_gpio */
#define PB13_GPIO MCHP_PINMUX(b, 13, gpio, gpio)

