zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/atsame54/atsame54p19a-pinctrl.h
/* pb20i_sdhc1_sddat2 */
#define PB20I_SDHC1_SDDAT2 MCHP_PINMUX(b, 20, i, periph)

/* pb20m_gclk_io6 */
#define PB20M_GCLK_IO6 MCHP_PINMUX(b, 20, m, periph)

/* pb21_gpio */
#define PB21_GPIO MCHP_PINMUX(b, 21, gpio, gpio)

/* pb21a_eic_extint5 */
#define PB21A_EIC_EXTINT5 MCHP_PINMUX(b, 21, a, periph)

/* pb21c_sercom3_pad1 */
#define PB21C_SERCOM3_PAD1 MCHP_PINMUX(b, 21, c, periph)

/* pb21d_sercom7_pad0 */
#define PB21D_SERCOM7_PAD0 MCHP_PINMUX(b, 21, d, periph)

/* pb21f_tcc1_wo3 */
#define PB21F_TCC1_WO3 MCHP_PINMUX(b, 21, f, periph)

/* pb21i_sdhc1_sddat3 */
#define PB21I_SDHC1_SDDAT3 MCHP_PINMUX(b, 21, i, periph)

/* pb21m_gclk_io7 */
#define PB21M_GCLK_IO7 MCHP_PINMUX(b, 21, m, periph)

/* pb22_gpio */
#define PB22_GPIO MCHP_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 MCHP_PINMUX(b, 22, a, periph)

/* pb22c_sercom1_pad2 */
#define PB22C_SERCOM1_PAD2 MCHP_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 MCHP_PINMUX(b, 22, d, periph)

/* pb22e_tc7_wo0 */
#define PB22E_TC7_WO0 MCHP_PINMUX(b, 22, e, periph)

/* pb22g_pdec_qdi2 */
#define PB22G_PDEC_QDI2 MCHP_PINMUX(b, 22, g, periph)

/* pb22h_usb_sof_1khz */
#define PB22H_USB_SOF_1KHZ MCHP_PINMUX(b, 22, h, periph)

/* pb22m_gclk_io0 */
#define PB22M_GCLK_IO0 MCHP_PINMUX(b, 22, m, periph)

/* pb22n_ccl_in0 */
#define PB22N_CCL_IN0 MCHP_PINMUX(b, 22, n, periph)

/* pb23_gpio */
#define PB23_GPIO MCHP_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 MCHP_PINMUX(b, 23, a, periph)

/* pb23c_sercom1_pad3 */
#define PB23C_SERCOM1_PAD3 MCHP_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 MCHP_PINMUX(b, 23, d, periph)

/* pb23e_tc7_wo1 */
#define PB23E_TC7_WO1 MCHP_PINMUX(b, 23, e, periph)

/* pb23g_pdec_qdi0 */
#define PB23G_PDEC_QDI0 MCHP_PINMUX(b, 23, g, periph)

/* pb23m_gclk_io1 */
#define PB23M_GCLK_IO1 MCHP_PINMUX(b, 23, m, periph)

/* pb23n_ccl_out0 */
#define PB23N_CCL_OUT0 MCHP_PINMUX(b, 23, n, periph)

/* pb24_gpio */
#define PB24_GPIO MCHP_PINMUX(b, 24, gpio, gpio)

/* pb24a_eic_extint8 */
#define PB24A_EIC_EXTINT8 MCHP_PINMUX(b, 24, a, periph)

/* pb24c_sercom0_pad0 */
#define PB24C_SERCOM0_PAD0 MCHP_PINMUX(b, 24, c, periph)

/* pb24d_sercom2_pad1 */
#define PB24D_SERCOM2_PAD1 MCHP_PINMUX(b, 24, d, periph)

/* pb24g_pdec_qdi1 */
#define PB24G_PDEC_QDI1 MCHP_PINMUX(b, 24, g, periph)

/* pb24m_ac_cmp0 */
#define PB24M_AC_CMP0 MCHP_PINMUX(b, 24, m, periph)

/* pb25_gpio */
#define PB25_GPIO MCHP_PINMUX(b, 25, gpio, gpio)

/* pb25a_eic_extint9 */
#define PB25A_EIC_EXTINT9 MCHP_PINMUX(b, 25, a, periph)

/* pb25c_sercom0_pad1 */
#define PB25C_SERCOM0_PAD1 MCHP_PINMUX(b, 25, c, periph)

/* pb25d_sercom2_pad0 */
#define PB25D_SERCOM2_PAD0 MCHP_PINMUX(b, 25, d, periph)

/* pb25g_pdec_qdi2 */
#define PB25G_PDEC_QDI2 MCHP_PINMUX(b, 25, g, periph)

/* pb25m_ac_cmp1 */
#define PB25M_AC_CMP1 MCHP_PINMUX(b, 25, m, periph)

/* pb26_gpio */
#define PB26_GPIO MCHP_PINMUX(b, 26, gpio, gpio)

/* pb26a_eic_extint12 */
#define PB26A_EIC_EXTINT12 MCHP_PINMUX(b, 26, a, periph)

/* pb26c_sercom2_pad0 */
#define PB26C_SERCOM2_PAD0 MCHP_PINMUX(b, 26, c, periph)

/* pb26d_sercom4_pad1 */
#define PB26D_SERCOM4_PAD1 MCHP_PINMUX(b, 26, d, periph)

/* pb26f_tcc1_wo2 */
#define PB26F_TCC1_WO2 MCHP_PINMUX(b, 26, f, periph)

/* pb27_gpio */
#define PB27_GPIO MCHP_PINMUX(b, 27, gpio, gpio)

/* pb27a_eic_extint13 */
#define PB27A_EIC_EXTINT13 MCHP_PINMUX(b, 27, a, periph)

/* pb27c_sercom2_pad1 */
#define PB27C_SERCOM2_PAD1 MCHP_PINMUX(b, 27, c, periph)

/* pb27d_sercom4_pad0 */
#define PB27D_SERCOM4_PAD0 MCHP_PINMUX(b, 27, d, periph)

/* pb27f_tcc1_wo3 */
#define PB27F_TCC1_WO3 MCHP_PINMUX(b, 27, f, periph)

/* pb28_gpio */
#define PB28_GPIO MCHP_PINMUX(b, 28, gpio, gpio)

/* pb28a_eic_extint14 */
#define PB28A_EIC_EXTINT14 MCHP_PINMUX(b, 28, a, periph)

/* pb28c_sercom2_pad2 */
#define PB28C_SERCOM2_PAD2 MCHP_PINMUX(b, 28, c, periph)

/* pb28d_sercom4_pad2 */
#define PB28D_SERCOM4_PAD2 MCHP_PINMUX(b, 28, d, periph)

/* pb28f_tcc1_wo4 */
#define PB28F_TCC1_WO4 MCHP_PINMUX(b, 28, f, periph)

/* pb28j_i2s_sck1 */
#define PB28J_I2S_SCK1 MCHP_PINMUX(b, 28, j, periph)

/* pb29_gpio */
#define PB29_GPIO MCHP_PINMUX(b, 29, gpio, gpio)

/* pb29a_eic_extint15 */
#define PB29A_EIC_EXTINT15 MCHP_PINMUX(b, 29, a, periph)

/* pb29c_sercom2_pad3 */
#define PB29C_SERCOM2_PAD3 MCHP_PINMUX(b, 29, c, periph)

/* pb29d_sercom4_pad3 */
#define PB29D_SERCOM4_PAD3 MCHP_PINMUX(b, 29, d, periph)

/* pb29f_tcc1_wo5 */
#define PB29F_TCC1_WO5 MCHP_PINMUX(b, 29, f, periph)

/* pb29j_i2s_mck1 */
#define PB29J_I2S_MCK1 MCHP_PINMUX(b, 29, j, periph)

/* pb30_gpio */
#define PB30_GPIO MCHP_PINMUX(b, 30, gpio, gpio)

/* pb30a_eic_extint14 */
#define PB30A_EIC_EXTINT14 MCHP_PINMUX(b, 30, a, periph)

/* pb30c_sercom7_pad0 */
#define PB30C_SERCOM7_PAD0 MCHP_PINMUX(b, 30, c, periph)

/* pb30d_sercom5_pad1 */
#define PB30D_SERCOM5_PAD1 MCHP_PINMUX(b, 30, d, periph)

/* pb30e_tc0_wo0 */
#define PB30E_TC0_WO0 MCHP_PINMUX(b, 30, e, periph)

/* pb30f_tcc4_wo0 */
#define PB30F_TCC4_WO0 MCHP_PINMUX(b, 30, f, periph)

/* pb30g_tcc0_wo6 */
#define PB30G_TCC0_WO6 MCHP_PINMUX(b, 30, g, periph)

/* pb31_gpio */
#define PB31_GPIO MCHP_PINMUX(b, 31, gpio, gpio)

/* pb31a_eic_extint15 */
#define PB31A_EIC_EXTINT15 MCHP_PINMUX(b, 31, a, periph)

/* pb31c_sercom7_pad1 */
#define PB31C_SERCOM7_PAD1 MCHP_PINMUX(b, 31, c, periph)

/* pb31d_sercom5_pad0 */
#define PB31D_SERCOM5_PAD0 MCHP_PINMUX(b, 31, d, periph)

/* pb31e_tc0_wo1 */
#define PB31E_TC0_WO1 MCHP_PINMUX(b, 31, e, periph)

/* pb31f_tcc4_wo1 */
#define PB31F_TCC4_WO1 MCHP_PINMUX(b, 31, f, periph)

/* pb31g_tcc0_wo7 */
#define PB31G_TCC0_WO7 MCHP_PINMUX(b, 31, g, periph)

/* pc0_gpio */
#define PC0_GPIO MCHP_PINMUX(c, 0, gpio, gpio)

/* pc0a_eic_extint0 */
#define PC0A_EIC_EXTINT0 MCHP_PINMUX(c, 0, a, periph)

/* pc0b_adc1_ain10 */
#define PC0B_ADC1_AIN10 MCHP_PINMUX(c, 0, b, periph)

/* pc1_gpio */
#define PC1_GPIO MCHP_PINMUX(c, 1, gpio, gpio)

/* pc1a_eic_extint1 */
#define PC1A_EIC_EXTINT1 MCHP_PINMUX(c, 1, a, periph)

/* pc1b_adc1_ain11 */
#define PC1B_ADC1_AIN11 MCHP_PINMUX(c, 1, b, periph)

/* pc2_gpio */
#define PC2_GPIO MCHP_PINMUX(c, 2, gpio, gpio)

/* pc2a_eic_extint2 */
#define PC2A_EIC_EXTINT2 MCHP_PINMUX(c, 2, a, periph)

