zephyrproject-rtos/hal_microchip/include/dt-bindings/sam/sam_d5x_e5x/atsame54/atsame54p19a-pinctrl.h
/* pc19_gpio */
#define PC19_GPIO MCHP_PINMUX(c, 19, gpio, gpio)

/* pc19a_eic_extint3 */
#define PC19A_EIC_EXTINT3 MCHP_PINMUX(c, 19, a, periph)

/* pc19c_sercom6_pad3 */
#define PC19C_SERCOM6_PAD3 MCHP_PINMUX(c, 19, c, periph)

/* pc19d_sercom0_pad3 */
#define PC19D_SERCOM0_PAD3 MCHP_PINMUX(c, 19, d, periph)

/* pc19f_tcc0_wo3 */
#define PC19F_TCC0_WO3 MCHP_PINMUX(c, 19, f, periph)

/* pc19l_gmac_gtxer */
#define PC19L_GMAC_GTXER MCHP_PINMUX(c, 19, l, periph)

/* pc20_gpio */
#define PC20_GPIO MCHP_PINMUX(c, 20, gpio, gpio)

/* pc20a_eic_extint4 */
#define PC20A_EIC_EXTINT4 MCHP_PINMUX(c, 20, a, periph)

/* pc20f_tcc0_wo4 */
#define PC20F_TCC0_WO4 MCHP_PINMUX(c, 20, f, periph)

/* pc20i_sdhc1_sdcd */
#define PC20I_SDHC1_SDCD MCHP_PINMUX(c, 20, i, periph)

/* pc20l_gmac_grxdv */
#define PC20L_GMAC_GRXDV MCHP_PINMUX(c, 20, l, periph)

/* pc20n_ccl_in9 */
#define PC20N_CCL_IN9 MCHP_PINMUX(c, 20, n, periph)

/* pc21_gpio */
#define PC21_GPIO MCHP_PINMUX(c, 21, gpio, gpio)

/* pc21a_eic_extint5 */
#define PC21A_EIC_EXTINT5 MCHP_PINMUX(c, 21, a, periph)

/* pc21f_tcc0_wo5 */
#define PC21F_TCC0_WO5 MCHP_PINMUX(c, 21, f, periph)

/* pc21i_sdhc1_sdwp */
#define PC21I_SDHC1_SDWP MCHP_PINMUX(c, 21, i, periph)

/* pc21l_gmac_gcol */
#define PC21L_GMAC_GCOL MCHP_PINMUX(c, 21, l, periph)

/* pc21n_ccl_in10 */
#define PC21N_CCL_IN10 MCHP_PINMUX(c, 21, n, periph)

/* pc22_gpio */
#define PC22_GPIO MCHP_PINMUX(c, 22, gpio, gpio)

/* pc22a_eic_extint6 */
#define PC22A_EIC_EXTINT6 MCHP_PINMUX(c, 22, a, periph)

/* pc22c_sercom1_pad0 */
#define PC22C_SERCOM1_PAD0 MCHP_PINMUX(c, 22, c, periph)

/* pc22d_sercom3_pad1 */
#define PC22D_SERCOM3_PAD1 MCHP_PINMUX(c, 22, d, periph)

/* pc22f_tcc0_wo6 */
#define PC22F_TCC0_WO6 MCHP_PINMUX(c, 22, f, periph)

/* pc22l_gmac_gmdc */
#define PC22L_GMAC_GMDC MCHP_PINMUX(c, 22, l, periph)

/* pc23_gpio */
#define PC23_GPIO MCHP_PINMUX(c, 23, gpio, gpio)

/* pc23a_eic_extint7 */
#define PC23A_EIC_EXTINT7 MCHP_PINMUX(c, 23, a, periph)

/* pc23c_sercom1_pad1 */
#define PC23C_SERCOM1_PAD1 MCHP_PINMUX(c, 23, c, periph)

/* pc23d_sercom3_pad0 */
#define PC23D_SERCOM3_PAD0 MCHP_PINMUX(c, 23, d, periph)

/* pc23f_tcc0_wo7 */
#define PC23F_TCC0_WO7 MCHP_PINMUX(c, 23, f, periph)

/* pc23l_gmac_gmdio */
#define PC23L_GMAC_GMDIO MCHP_PINMUX(c, 23, l, periph)

/* pc24_gpio */
#define PC24_GPIO MCHP_PINMUX(c, 24, gpio, gpio)

/* pc24a_eic_extint8 */
#define PC24A_EIC_EXTINT8 MCHP_PINMUX(c, 24, a, periph)

/* pc24c_sercom0_pad2 */
#define PC24C_SERCOM0_PAD2 MCHP_PINMUX(c, 24, c, periph)

/* pc24d_sercom2_pad2 */
#define PC24D_SERCOM2_PAD2 MCHP_PINMUX(c, 24, d, periph)

/* pc24h_tpiu_traced3 */
#define PC24H_TPIU_TRACED3 MCHP_PINMUX(c, 24, h, periph)

/* pc25_gpio */
#define PC25_GPIO MCHP_PINMUX(c, 25, gpio, gpio)

/* pc25a_eic_extint9 */
#define PC25A_EIC_EXTINT9 MCHP_PINMUX(c, 25, a, periph)

/* pc25c_sercom0_pad3 */
#define PC25C_SERCOM0_PAD3 MCHP_PINMUX(c, 25, c, periph)

/* pc25d_sercom2_pad3 */
#define PC25D_SERCOM2_PAD3 MCHP_PINMUX(c, 25, d, periph)

/* pc25h_tpiu_traced2 */
#define PC25H_TPIU_TRACED2 MCHP_PINMUX(c, 25, h, periph)

/* pc26_gpio */
#define PC26_GPIO MCHP_PINMUX(c, 26, gpio, gpio)

/* pc26a_eic_extint10 */
#define PC26A_EIC_EXTINT10 MCHP_PINMUX(c, 26, a, periph)

/* pc26h_tpiu_traced1 */
#define PC26H_TPIU_TRACED1 MCHP_PINMUX(c, 26, h, periph)

/* pc27_gpio */
#define PC27_GPIO MCHP_PINMUX(c, 27, gpio, gpio)

/* pc27a_eic_extint11 */
#define PC27A_EIC_EXTINT11 MCHP_PINMUX(c, 27, a, periph)

/* pc27c_sercom1_pad0 */
#define PC27C_SERCOM1_PAD0 MCHP_PINMUX(c, 27, c, periph)

/* pc27h_tpiu_traceclk */
#define PC27H_TPIU_TRACECLK MCHP_PINMUX(c, 27, h, periph)

/* pc27n_ccl_in4 */
#define PC27N_CCL_IN4 MCHP_PINMUX(c, 27, n, periph)

/* pc28_gpio */
#define PC28_GPIO MCHP_PINMUX(c, 28, gpio, gpio)

/* pc28a_eic_extint12 */
#define PC28A_EIC_EXTINT12 MCHP_PINMUX(c, 28, a, periph)

/* pc28c_sercom1_pad1 */
#define PC28C_SERCOM1_PAD1 MCHP_PINMUX(c, 28, c, periph)

/* pc28h_tpiu_traced0 */
#define PC28H_TPIU_TRACED0 MCHP_PINMUX(c, 28, h, periph)

/* pc28n_ccl_in5 */
#define PC28N_CCL_IN5 MCHP_PINMUX(c, 28, n, periph)

/* pc30_gpio */
#define PC30_GPIO MCHP_PINMUX(c, 30, gpio, gpio)

/* pc30a_eic_extint14 */
#define PC30A_EIC_EXTINT14 MCHP_PINMUX(c, 30, a, periph)

/* pc30b_adc1_ain12 */
#define PC30B_ADC1_AIN12 MCHP_PINMUX(c, 30, b, periph)

/* pc31_gpio */
#define PC31_GPIO MCHP_PINMUX(c, 31, gpio, gpio)

/* pc31a_eic_extint15 */
#define PC31A_EIC_EXTINT15 MCHP_PINMUX(c, 31, a, periph)

/* pc31b_adc1_ain13 */
#define PC31B_ADC1_AIN13 MCHP_PINMUX(c, 31, b, periph)

/* pd0_gpio */
#define PD0_GPIO MCHP_PINMUX(d, 0, gpio, gpio)

/* pd0a_eic_extint0 */
#define PD0A_EIC_EXTINT0 MCHP_PINMUX(d, 0, a, periph)

/* pd0b_adc1_ain14 */
#define PD0B_ADC1_AIN14 MCHP_PINMUX(d, 0, b, periph)

/* pd1_gpio */
#define PD1_GPIO MCHP_PINMUX(d, 1, gpio, gpio)

/* pd1a_eic_extint1 */
#define PD1A_EIC_EXTINT1 MCHP_PINMUX(d, 1, a, periph)

/* pd1b_adc1_ain15 */
#define PD1B_ADC1_AIN15 MCHP_PINMUX(d, 1, b, periph)

/* pd8_gpio */
#define PD8_GPIO MCHP_PINMUX(d, 8, gpio, gpio)

/* pd8a_eic_extint3 */
#define PD8A_EIC_EXTINT3 MCHP_PINMUX(d, 8, a, periph)

/* pd8c_sercom7_pad0 */
#define PD8C_SERCOM7_PAD0 MCHP_PINMUX(d, 8, c, periph)

/* pd8d_sercom6_pad1 */
#define PD8D_SERCOM6_PAD1 MCHP_PINMUX(d, 8, d, periph)

/* pd8f_tcc0_wo1 */
#define PD8F_TCC0_WO1 MCHP_PINMUX(d, 8, f, periph)

/* pd9_gpio */
#define PD9_GPIO MCHP_PINMUX(d, 9, gpio, gpio)

/* pd9a_eic_extint4 */
#define PD9A_EIC_EXTINT4 MCHP_PINMUX(d, 9, a, periph)

/* pd9c_sercom7_pad1 */
#define PD9C_SERCOM7_PAD1 MCHP_PINMUX(d, 9, c, periph)

/* pd9d_sercom6_pad0 */
#define PD9D_SERCOM6_PAD0 MCHP_PINMUX(d, 9, d, periph)

/* pd9f_tcc0_wo2 */
#define PD9F_TCC0_WO2 MCHP_PINMUX(d, 9, f, periph)

/* pd10_gpio */
#define PD10_GPIO MCHP_PINMUX(d, 10, gpio, gpio)

/* pd10a_eic_extint5 */
#define PD10A_EIC_EXTINT5 MCHP_PINMUX(d, 10, a, periph)

/* pd10c_sercom7_pad2 */
#define PD10C_SERCOM7_PAD2 MCHP_PINMUX(d, 10, c, periph)

/* pd10d_sercom6_pad2 */
#define PD10D_SERCOM6_PAD2 MCHP_PINMUX(d, 10, d, periph)

